TAL_INT_GIT/Sample Data/Nupco/SO_Create/input/so_create_soap_new_input/so_create_soap_new_input

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header />
   <soapenv:Body>
      <urn:ZMM_POST_SALESORDER_V2 xmlns:urn="urn:sap-com:document:sap:rfc:functions">
         <I_SO_DET>
            <item>
               <I_HEADER>
                  <SALESDOCUMENTIN />
                  <DOC_TYPE>ZN01</DOC_TYPE>
                  <SALES_ORG>1000</SALES_ORG>
                  <DISTR_CHAN>10</DISTR_CHAN>
                  <DIVISION>00</DIVISION>
                  <REQ_DATE_H>2021-02-05</REQ_DATE_H>
                  <PURCH_DATE />
                  <PURCH_NO_C>CustPO</PURCH_NO_C>
                  <CURRENCY>SAR</CURRENCY>
                  <MAWARID_NO>MWRD123</MAWARID_NO>
                  <ORD_REASON>Z01</ORD_REASON>
                  <REF_DOC>1987</REF_DOC>
               </I_HEADER>
               <I_T_ITEM>
                  <item>
                     <ITM_NUMBER>10</ITM_NUMBER>
                     <MATERIAL>5050160100210</MATERIAL>
                     <BATCH />
                     <PLANT>C2C1</PLANT>
                     <STORE_LOC>1000</STORE_LOC>
                     <TARGET_QTY>10</TARGET_QTY>
                     <SALES_UNIT>PAK</SALES_UNIT>
                     <DLV_PRIO>02</DLV_PRIO>
                  </item>
               </I_T_ITEM>
               <I_T_PARTNERS>
                  <item>
                     <PARTN_ROLE>SD</PARTN_ROLE>
                     <PARTN_NUMB>120003</PARTN_NUMB>
                  </item>
                  <item>
                     <PARTN_ROLE>SH</PARTN_ROLE>
                     <PARTN_NUMB>120003</PARTN_NUMB>
                  </item>
               </I_T_PARTNERS>
            </item>
         </I_SO_DET>
      </urn:ZMM_POST_SALESORDER_V2>
   </soapenv:Body>
</soapenv:Envelope>